[
  {
    "clubname": "Act for Change",
    "clubadvisor": "Elmasri",
    "clubleader": "Aven Chew",
    "Club Secretary:": "Pragya Mathur",
    "clubmeeting": "Mondays every other week, Lunch, S5",
    "clubinfo": "Act for Change provides opportunities for students to speak out on issues they are passionate about. With the help of political leaders, group volunteering, and fundraisers, we will work together to better our communities. The Act for Change club will provide the proper connections in order to make an idea a reality, for all voices need to be heard.",
    "contactinfo": "josephelmasri@iusd.org & chewaven@gmail.com",
    "Secretary Email:": "pragyam2015@gmail.com"
  },
  {
    "clubname": "Act of Random Kindness",
    "clubadvisor": "Mrs. Eagleson",
    "clubleader": "Rhea Mogulla",
    "Club Secretary:": "Nuha Khan/Shriya Mokkapati",
    "clubmeeting": " First Tuesday of the month, in S6, during lunch ",
    "clubinfo": "The ARK club's mission is to help people in our community and spread positivity, hoping to inspire kindness into people’s everyday lives. As students are stressed, we strive to make the campus a more pleasant experience by conducting uplifting actives and projects.",
    "contactinfo": "breeagleson@iusd.org & rheamogulla@gmail.com",
    "Secretary Email:": "nuha.r.khan51406@gmail.com"
  },
  {
    "clubname": "AfterMath",
    "clubadvisor": "Ms. Kurdziel",
    "clubleader": "Emily Liu/Athena Chen",
    "Club Secretary:": "Lawrence Shi",
    "clubmeeting": "Fridays, first half of lunch, M3",
    "clubinfo": "AfterMath is a club for people to learn about interesting math topics that are not taught in high school and to play math-related games for potential prizes. All grade levels are welcome! No prior knowledge necessary; topics will rely on creative thinking and logic. If you are interested in exploring math outside of math class, or just enjoy logic puzzles, join AfterMath!",
    "contactinfo": "kimberlykurdziel@iusd.org, emilyliu7789@gmail.com & athenachen7@gmail.com",
    "Secretary Email:": "bubblelarrypao@gmail.com"
  },
  {
    "clubname": "American Chemical Society",
    "clubleader": "Mannat"
  },
  {
    "clubname": "Artifigenix (Artificial Intelligence Club)",
    "clubadvisor": "Sakallah, Faten",
    "clubleader": "Vishal Viswa",
    "Club Secretary:": "Sujith Shen",
    "clubmeeting": "Every other week Friday during lunch at M6",
    "clubinfo": "Artifigenix is and AI Club where members will learn and understand how Artificial Intelligence works and the different methods there are to program it. We will also have events and further exploring hand-on activities regarding AI by which there will also be Volunteer opportunities. Apart from that the main focus on this club is learn and understand the different forms of AI in a fun and interesting method.",
    "contactinfo": "FatenSakallah@iusd.org & vishalviswa88@gmail.com",
    "Secretary Email:": "SujithShen@gmail.com"
  },
  {
    "clubname": "Asian Youth Collective",
    "clubadvisor": "Luna Bai",
    "clubleader": "Madeline Chan",
    "Club Secretary:": "Elise Shih",
    "clubmeeting": "Every other Wednesday, at lunch, S2",
    "clubinfo": "The Asian Youth Collective’s goal is to allow Asian students to share their personal connection with their culture and learn about the diverse Asian groups within our community. We will play music, host discussions, potlucks, and events surrounding cultural days or foods, and more. This is a unique opportunity for students to educate their peers on their experience with their culture.",
    "contactinfo": "lunabai@iusd.org & maddyychann@gmail.com ",
    "Secretary Email:": "chiirkyy@gmail.com"
  },
  {
    "clubname": "B Team-Up",
    "clubadvisor": "Mrs. Fair",
    "clubleader": "Alexis Celine Kim",
    "Club Secretary:": "Phoebe Lin",
    "clubmeeting": "Once a month on the second Tuesday, during lunch, @M8",
    "clubinfo": "The B Team-Up club is a volunteering club affiliated with the organization B Team-Up. We have a \"B\" instead of an \"A\" because our mission is to help people or groups that typically fall to the wayside in attention. Our activities will include helping out hospitals, contributing to saving our environment, and global outreach events.",
    "contactinfo": "stephaniefair@iusd.org & celinekim0615@gmail.com",
    "Secretary Email:": "phoebe.036.lin@gmail.com"
  },
  {
    "clubname": "B Team-Up",
    "clubadvisor": "Mrs. Stephanie Fair",
    "clubleader": "Alexis Celine Kim",
    "Club Secretary:": "Phoebe Lin",
    "clubmeeting": "once a month (Tues, week TBD), during lunch, @M8",
    "clubinfo": "The B Team-Up club is a volunteering club affiliated with the organization B Team-Up. We have a \"B\" instead of an \"A\" because our mission is to team up to help people or groups that typically fall to the wayside in attention. Our activities will include helping out hospitals, contributing to saving our environment, and global outreach events.",
    "contactinfo": "stephaniefair@iusd.org & celinekim0615@gmail.com",
    "Secretary Email:": "phoebe.036.lin@gmail.com"
  },
  {
    "clubname": "Badminton Club",
    "clubadvisor": "Mrs. Baker",
    "clubleader": "Jeslyn Chuang",
    "Club Secretary:": "Sofia Wadsworth",
    "clubmeeting": "last Thursday of each month at lunch in the practice gym.",
    "clubinfo": "Badminton Club aims to serve as a fun way to learn badminton with your peers. We welcome players of all levels, no experience is necessary, simply a desire to learn!",
    "contactinfo": "lisabaker@iusd.org & jeslynchuang@gmail.com",
    "Secretary Email:": "Sofia.m.wadsworth@gmail.com"
  },
  {
    "clubname": "Beauty Club",
    "clubadvisor": "Mr. Chaney",
    "clubleader": "Zohal Samadi",
    "Club Secretary:": "Mina Alsaffar",
    "clubmeeting": "Lunch in H-16--days to be determined by October",
    "clubinfo": "In our club we will teach girls how to do nails, hair and henna as a way to socialize and be creative with other girls",
    "contactinfo": "MISSING clubadvisor & samadi.zohal@gmail.com",
    "Secretary Email:": "minaalsaffar84@gmail.com"
  },
  {
    "clubname": "Best Buddies",
    "clubadvisor": "Sara Reeves",
    "clubleader": "Kinley Moshenko",
    "Club Secretary:": "Callie Shane",
    "clubmeeting": "TBD",
    "clubinfo": "Best Buddies is an organization dedicated to stopping the physical, social, and economic isolation of people with intellectual and developmental disabilities (IDD). Our club specifically is focused on helping people with IDD form meaningful friendships with their peers at school. By joining Best Buddies, you are helping others with IDD, or even yourself if you have IDD, with communication skills, self-advocacy, building relationships, and feeling valued.",
    "contactinfo": "SaraReeves@iusd.org & kinleymoshenko@gmail.com",
    "Secretary Email:": "callieshane25@gmail.com"
  },
  {
    "clubname": "Book Drive Club",
    "clubadvisor": "Michael Civalleri",
    "clubleader": "Neil Pal",
    "Club Secretary:": "Soham Sarkar",
    "clubmeeting": "Tuesdays, Lunch, Library",
    "clubinfo": "Our club, Book Drive Club, aims to collect donations of new and used books, sort them, and donate to underprivileged communities and other places where they can be essentially given new life. We aim to help repurpose these books to go to those who can use and learn from them. People should join as it allows them to help other communities that may not be as fortunate as them.",
    "contactinfo": "michaelcivalleri@iusd.org & 23palneil@gmail.com",
    "Secretary Email:": "23sarkarsoham@gmail.com"
  },
  {
    "clubname": "Change to Community (c2c)",
    "clubadvisor": "Ms. Cortez",
    "clubleader": "Heidi Jung",
    "Club Secretary:": "Charlene Nguyen",
    "clubmeeting": "Every Wednesday,during lunch, room S1",
    "clubinfo": "C2C is part of a bigger organization called OCKCL (orange country korean american citizenship league). We thought that it would be a good idea to spread the ideas and works of what OCKCL is doing to our school to help students get through their long hours and stressful years by art activities that will hopefully also help lower their stress levels from all the test, quizzes, classworks, and more.",
    "contactinfo": "michellecortez@iusd.org & heidijung12@gmail.com",
    "Secretary Email:": "charlenehnguyen07@gmail.com"
  },
  {
    "clubname": "Chess Club",
    "clubadvisor": "Mr. Crowe",
    "clubleader": "Isa Ozer",
    "Club Secretary:": "Ryan Lee",
    "clubmeeting": "Wednesdays, Lunch, M8",
    "clubinfo": "Chess Club is a place for players of all levels to play and learn chess with their peers. Any student is welcome, regardless of chess background. We will be holding monthly tournaments with the other IUSD Chess Clubs - the Top contestants will receive a prize!",
    "contactinfo": "RichardCrowe@iusd.org & iozer6407@gmail.com",
    "Secretary Email:": "lee.ryan.jj@gmail.com"
  },
  {
    "clubname": "CHOC Club",
    "clubadvisor": "Munsell",
    "clubleader": "Reilly Chow/ Lily Wu",
    "Club Secretary:": "Misty Aldrin",
    "clubmeeting": "Thursday, Lunch, H19",
    "clubinfo": "We want to coordinate events with the CHOC children's hospital and fundraise, donate, and set events. People should join if they have interest in pediatric care or general medicine.",
    "contactinfo": "StevenMunsell@iusd.org, masubi02@gmail.com, & lxlyywu@gmail.com",
    "Secretary Email:": "mistyaldrin2@gmail.com"
  },
  {
    "clubname": "Chordinated Chaos",
    "clubadvisor": "Ben Glasner",
    "clubleader": "Ashlynn Weidenbenner",
    "Club Secretary:": "Sreenidhi",
    "clubmeeting": "Tuesday/Thursday 7:45-8:25, Wednesday Lunch, VM",
    "clubinfo": "Chordinated Chaos is an inclusive acapella group, for all voice parts and abilities. There is no requirement to be in a music class, and students can come learn to sing the acapella style of music in a fun and constructive environment.",
    "contactinfo": "benglasner@iusd.org & ashlynn.weidenbenner@gmail.com",
    "Secretary Email:": "24sreenidhisrinivasan@iusd.org"
  },
  {
    "clubname": "Civic Action Now",
    "clubadvisor": "Dr. Hurst",
    "clubleader": "Ishaan Gaikwad",
    "Club Secretary:": "Aashay Mody",
    "clubmeeting": "Every other week on Wednesdays, During Lunch, WL9",
    "clubinfo": "Civic Action Now gives members the opportunity to be a part of the American political system. Among our planned events are canvassing to encourage people in areas with low turnout to vote, attending local political meetings(city council, school board), interning for local politicians, and potentially even working at polling stations or traveling to Sacramento to gain a better understanding of California's politics.",
    "contactinfo": "darinhurst@iusd.org & ishaangaikwad@gmail.com",
    "Secretary Email:": "aashaymody17@gmail.com"
  },
  {
    "clubname": "Cloud 9 Club",
    "clubadvisor": "Mrs. Briseno",
    "clubleader": "Alice Blackwell",
    "Club Secretary:": "Kara Terray",
    "clubmeeting": "Thursday’s twice a month, lunch time, WL5",
    "clubinfo": "Our main purpose of this club is to spread smiles and bring joy to other’s as if they were on cloud 9. We will be finding ways for people to cope and find new interests like, painting, sharing music with one another, reading, etc. We want other to Join to in hopes help them find new interests and make new friends along the way.",
    "contactinfo": "KarenBriseno@iusd.org & aliceblackwell06@gmail.com",
    "Secretary Email:": "Karaterray@gmail.com"
  },
  {
    "clubname": "Crochet Club",
    "clubadvisor": "Mr.  Chaney",
    "clubleader": "Yvanna Granados",
    "Club Secretary:": "Amalia Le",
    "clubmeeting": "Tuesdays and Thursdays at lunch and Thursday from 4-6",
    "clubinfo": "The Crochet Club is a place where people can learn how to crochet, knit, make bracelets and any activity involving yarn. We will have experienced people that teach others how to read crochet patterns and show them how indulge in this cool hobby. By joining the crochet club you have a safe space to meet new friends and take part in our school while learning how to master yarn.",
    "contactinfo": "jasonclark@iusd.org & yvannasofiagranados@gmail.com",
    "Secretary Email:": "Amaliale2004@gmail.com"
  },
  {
    "clubname": "CSF (California Scholarship Federation)",
    "clubadvisor": "Mrs. Harrington",
    "clubleader": "Annabelle Wu",
    "Club Secretary:": "Alexa Jones",
    "clubmeeting": "Every other Wednesday, Lunch, HLG or SS202",
    "clubinfo": "We are one of Irvine High’s biggest honor societies and are affiliated with the statewide organization of CSF. Our mission is to positively encourage community service among highly motivated students by offering a wide variety of opportunities to make a positive impact on local communities. We hope students can leave this club not only with a graduation cord, but a newfound understanding of the value of philanthropy.",
    "contactinfo": "jenniferharrington@iusd.org & anyuewu05@gmail.com",
    "Secretary Email:": "tinker72306@gmail.com"
  },
  {
    "clubname": "CyperPatriots",
    "clubadvisor": "Mrs. Sakallah",
    "clubleader": "Rishi Padmanabhan",
    "Club Secretary:": "Harish Seenivasan",
    "clubmeeting": "Thursdays @ Lunch in M6",
    "clubinfo": "CyberPatriots is a club dedicated to the CyberPatriot cybersecurity competition. We help members train for this competition through instructional presentations.",
    "contactinfo": "fatensakallah@iusd.org & rishi.padman@gmail.com",
    "Secretary Email:": "hariseeni123@gmail.com"
  },
  {
    "clubname": "DAY (Dear Asian Youth)",
    "clubadvisor": "Mrs. Bai",
    "clubleader": "Niki Saleh",
    "Club Secretary:": "Niki Saleh",
    "clubmeeting": "Last Friday of the month, 12:10-12:15, S3",
    "clubinfo": "A youth-led, global organization that promotes intersectional activism, solidarity with other marginalized communities, and equality and equity. It is our mission to showcase diversity in the Asian community as well as accurate and holistic representation. Our activities will help be educational and open to bond with one another.",
    "contactinfo": "LunaBai@iusd.org & nsaleh.24ca@gmail.com",
    "Secretary Email:": "nsaleh.24ca@gmail.com"
  },
  {
    "clubname": "Den of Drones",
    "clubadvisor": "Mrs. Krusmark",
    "clubleader": "Rishabh Dedhia",
    "Club Secretary:": "Connor Siu",
    "clubmeeting": "Every other Thursday, lunch, H4",
    "clubinfo": "The Den of Drones is an open environment for those who have an interest in building, flying, and racing drones.",
    "contactinfo": "madisonkrusmark@iusd.org & Rishabh.dedhia05@gmail.com",
    "Secretary Email:": "justsometerriblepuns@gmail.com"
  },
  {
    "clubname": "Digital Art Club",
    "clubadvisor": "Miriam Khurgel",
    "clubleader": "Pujitha Velivela",
    "Club Secretary:": "Towako Wunsch",
    "clubmeeting": "Wednesdays and Thursdays, 12:15 PM, UA3",
    "clubinfo": "Being passionate about digital art, we would like to establish a safe space and community on campus for other digital artists. Becoming a part of this club means volunteering associated with art, growing as an artist, and making friends with similar interests.",
    "contactinfo": "MiriamKhurgel@iusd.org & pujitha.velivela29@gmail.com",
    "Secretary Email:": "towahime@gmail.com"
  },
  {
    "clubname": "Document Preservation Club",
    "clubadvisor": "Michael Civalleri",
    "clubleader": "Harmony Yan-Li",
    "Club Secretary:": "Aram Filhanessian",
    "clubmeeting": "Tuesday weekly during lunch, Library",
    "clubinfo": "Earn volunteer hours by aiding in the preservation of historical documents by transcribing archived scans into digital text records. With documents from Smithsonian Institute, Library of Congress, and National Archives, explore the niches of history and expand the records of our past.",
    "contactinfo": "michaelcivalleri@iusd.org & harmonyyanli@gmail.com",
    "Secretary Email:": "filhanessianaram@gmail.com"
  },
  {
    "clubname": "Drowning Prevention",
    "clubadvisor": "Jason Clark",
    "clubleader": "Alessandra Nando-Ramirez",
    "Club Secretary:": "Lily Salazar",
    "clubmeeting": "Friday, 10:25-10:35, M12",
    "clubinfo": "The club would be a way for people to learn the basics of CPR in case of an emergency and also just more general information about drowning like who it specifically affects more and just to bring more awareness on the subject.",
    "contactinfo": "jasonclark@iusd.org & Alessandra2731@outlook.com",
    "Secretary Email:": "Lillypanda630@gmail.com"
  },
  {
    "clubname": "dungeons and dragons(d&d) club",
    "clubadvisor": "Mr. Clark",
    "clubleader": "Jack Martin",
    "Club Secretary:": "Aiden Hoffman",
    "clubmeeting": "Mondays, 3:40-5:00, M12",
    "clubinfo": "in the d&d club, we teach how to play dungeons and dragons once a week with students. we help students who either play d&d but don't have the people to play with, people who have wanted to get into and start playing dnd but never have, or people who like playing games, making friends, and using their imagination.",
    "contactinfo": " clubadvisor EMAIL & 26martinjack@iusd.org",
    "Secretary Email:": "W.Aid3n.Hoffman@gmail.com"
  },
  {
    "clubname": "Earth club",
    "clubadvisor": "Ms. Cortez",
    "clubleader": "Nikitha Mateti",
    "Club Secretary:": "Li Min Ong",
    "clubmeeting": "Every other week on Thursdays, during lunch, Room S1",
    "clubinfo": "As climate change looms as an ever-concerning threat, students must rise up and take active part in their community to implement big change on a local level. Join the Earth club to learn more about the impact of global warming, take active measures in your community and on campus, and develop a more affluent Irvine that fights for change! With your service, we can rise above and beyond to maintain parks, wildlife, and bring positive change in the government that addresses the climate crisis.",
    "contactinfo": "michellecortez@iusd.org &  nikithamateti@gmail.com",
    "Secretary Email:": "liminous8@gmail.com"
  },
  {
    "clubname": "Eplaytogether",
    "clubadvisor": "Rebecca Oh",
    "clubleader": "Heidi Jung",
    "Club Secretary:": "Charlene Nguyen",
    "clubmeeting": "every Tuesday at Lunch, room SS104",
    "clubinfo": "Eplaytogether is going to be a program in which the elderly and the younger generation can connect with each other through games. With Covid restrictions it became harder to connect with family members, especially those in senior homes. This will be a club which there will be an online website based on accessibility and simplicity divided into 2 groups, the “volunteers” and the “learners.” The “Volunteer” role is to create “services” and these service is a time and date where the volunteer is willing to interact with a learner. The “learners” choose a service/activity and then are able to create a reservation for it.",
    "contactinfo": "rebeccaoh@iusd.org & heidijung12@gmail.com",
    "Secretary Email:": "charlenehnguyen07@gmail.com"
  },
  {
    "clubname": "EVOLVE",
    "clubadvisor": "Michelle Cortez",
    "clubleader": "Aashay Mody",
    "Club Secretary:": "Ishaan Gaikwad",
    "clubmeeting": "TBD day, bi-weekly in Room S1 during lunch",
    "clubinfo": "EVOLVE provides students at Irvine High School with opportunities to take action for the environment. From habitat restorations to beach cleanups, and much more, there are so many ways people can improve the world around them. As a result, members of EVOLVE will foster positive environmental change, while learning critical leadership and communication skills",
    "contactinfo": "michellecortez@iusd.org & aashaymody@hotmail.com",
    "Secretary Email:": "ishaangaikwad@gmail.com"
  },
  {
    "clubname": "Fellowship of Christian Athletes (FCA)",
    "clubadvisor": "Gabriel Cota",
    "clubleader": "Addison Boomsma",
    "Club Secretary:": "Maryn Boomsma",
    "clubmeeting": " 2 huddles a month, meetings will be in SS106 during lunch",
    "clubinfo": "This club provides a safe place where you can meet and share the love of Jesus with your fellow students. You can also help plan our huddles to continue sharing the love of christ with more of our study body during lunches.",
    "contactinfo": "GabrielCota@iusd.org & boomsma.addison@gmail.com",
    "Secretary Email:": "boomsma.maryn@gmail.com"
  },
  {
    "clubname": "FIDM Fashion Club",
    "clubadvisor": "Erika Perales",
    "clubleader": "Eman",
    "Club Secretary:": "Lana Alsamawi",
    "clubmeeting": "TBD",
    "clubinfo": "People should join because in this club you can find a way to express yourself and you can have a sense of community with us. We go more in depth into the fashion world with different topics and hands on activities and learn about each other in the process! Overall it is a great club if your interested in the fashion world for fun or as more and we have so many different topics and others that we go through and it'll be a fun experience for everyone!",
    "contactinfo": "erikaperales@iusd.org & eman.arian.asefi5@gmail.com",
    "Secretary Email:": "lanaalsamawi3@gmail.com"
  },
  {
    "clubname": "FIDM Fashion Club",
    "clubadvisor": "Ms. Chen",
    "clubleader": "Eman Asefi",
    "Club Secretary:": "Lana Alsamawi",
    "clubmeeting": "TBD",
    "clubinfo": "In this club we basically do hands on activities and educate ourself about the different parts of the industry. We want to help people figure out if they like fashion and how they can use it in their lives for example by learning how to sew which is a basic thing you can know and you'll use for the rest of your life. We also help people with having a community and helping them just have a good time and to learn at the same time.",
    "contactinfo": "sophiachen@iusd.org & eman.arian.asefi5@gmail.com",
    "Secretary Email:": "lanaalsamawi3@gmail.com"
  },
  {
    "clubname": "Irvine HS Investing Club",
    "clubadvisor": "Gary Russell",
    "clubleader": "Keira Vu",
    "Club Secretary:": "Rhea Mogulla",
    "clubmeeting": "First Thursday of each month in UA12 during lunch",
    "clubinfo": "All students interested in investing and stocks are welcome to join, no experience is necessary! Our mission is to increase financial literacy by teaching our members responsible investing and introducing them to the stock market.",
    "contactinfo": "GaryRussell@iusd.org & keiramvu@gmail.com",
    "Secretary Email:": "rheamogulla@gmail.com"
  },
  {
    "clubname": "French Honor Society",
    "clubadvisor": "Madame Gallo",
    "clubleader": "Sabrina Aouad",
    "Club Secretary:": "Nelly Thai",
    "clubmeeting": "TBD",
    "clubinfo": "We organize to celebrate and promote French and Francophone culture. Though members of the honor society are invited, other students are encouraged to partake in activities the society organizes as well. We do many culinary events such as crepe making, Moroccan tea tasting, buche de Noel decorating, fondue making, and so much more.",
    "contactinfo": "TracyGallo@iusd.org & sabrinayhaouad@gmail.com",
    "Secretary Email:": "nellythai151@gmail.com"
  },
  {
    "clubname": "Frontier Club",
    "clubadvisor": "Chris Nguyen",
    "clubleader": "Callie Shane",
    "Club Secretary:": "josh la scala",
    "clubmeeting": "game gym during lunch every other Thursday",
    "clubinfo": "The Frontier is all about showing school spirit and representing our school in all athletics. Our Frontier student section's goal is to encourage and show Vaquero pride.",
    "contactinfo": "ChrisNguyen@iusd.org &  calllieshane25@iusd.org",
    "Secretary Email:": "jlascala2006@gmail.com"
  },
  {
    "clubname": "Girls Who Code",
    "clubadvisor": "Sakallah",
    "clubleader": "Alana Zhao",
    "Club Secretary:": "Sarah Compton",
    "clubmeeting": "Thursdays @ Lunch. M6",
    "clubinfo": "Girls Who Code aims to encourage gender diversity in the Computer Science field. Develop your coding skills, create interesting projects, and teach others. Welcoming to both new coders and experienced coders!",
    "contactinfo": "fatensakallah@iusd.org & alanazhao2023@gmail.com",
    "Secretary Email:": "comptosr@gmail.com"
  },
  {
    "clubname": "Giving Sprouts",
    "clubadvisor": "Mr. Chaney",
    "clubleader": "Ashley Pak",
    "Club Secretary:": "Claire Hong",
    "clubmeeting": "Every other week on Tuesday during lunch in H16.",
    "clubinfo": "Giving Sprouts is a non-profit organization where mostly high schoolers teach elementary students with a lower socioeconomic background. If you join this club, you will first be trained on how to teach a student, then start teaching a student of your own through ZOOM when you are qualified. Our club has so much to offer like a valuable experience of teaching, forming relationships with students, and even service hours.",
    "contactinfo": "michaelchaney@iusd.org & ashleypak2004@gmail.com",
    "Secretary Email:": "eunjie1128@gmail.com"
  },
  {
    "clubname": "Guitar Club",
    "clubadvisor": "Josue Valle",
    "clubleader": "Paul Chau",
    "Club Secretary:": "Nathan Dong",
    "clubmeeting": "Mondays, Lunch, MLAB",
    "clubinfo": "The Guitar Club is a casual, relaxed place for all guitarists, from complete beginners to experts, to play, study, and have fun with their instrument. Members may borrow guitars from the school for the duration of meetings for a small fee.",
    "contactinfo": "JosueValle@iusd.org & paul.son.chau@gmail.com",
    "Secretary Email:": "nathan1dong@gmail.com"
  },
  {
    "clubname": "Habitat for Humanity",
    "clubadvisor": "Hughes",
    "clubleader": "Maddie Kim",
    "Club Secretary:": "Kalia Kau",
    "clubmeeting": "Day TBD, lunch,  #S10",
    "clubinfo": "Habitat for Humanity is a club based around providing affordable housing for low-income families in Orange County. We hold a lot of fundraisers and offer relaxed and fun volunteer opportunities.",
    "contactinfo": "kerryhughes@iusd.org & maddieandminnie@gmail.com",
    "Secretary Email:": "kaliakau77@gmail.com"
  },
  {
    "clubname": "HOSA",
    "clubadvisor": "Luna Bai",
    "clubleader": "Ava Mehraein",
    "Club Secretary:": "Ashley Cho",
    "clubmeeting": "Wednesdays, lunch, S3",
    "clubinfo": "HOSA is a club dedicated to giving high schoolers experiences in medicine through various mediums such as research and volunteering. You should join this club to be able to receive health/medicine related volunteer experience. This experience can help you get an insight of what it is like to work in the medical field.",
    "contactinfo": "LunaBai@iusd.org & vamehraein@gmail.com",
    "Secretary Email:": "ashhleycho@gmail.com"
  },
  {
    "clubname": "IHS Book Club",
    "clubadvisor": "Mr. Crowe",
    "clubleader": "Shelby Crowe",
    "Club Secretary:": "TBD",
    "clubmeeting": "Thursdays once a month during lunch in room M2",
    "clubinfo": "We are a social club who read and discuss books together. It is a safe space for fellow readers to give book opinions, read, and discuss. It is a way to promote reading and open discussion at school.",
    "contactinfo": "richardcrowe@iusd.org & sscrowe2424@gmail.com",
    "Secretary Email:": "TBD"
  },
  {
    "clubname": "IHS Holt International",
    "clubleader": "Cera Pascua",
    "clubmeeting": "Thursday once a month lunch UA3",
    "contactinfo": "cerapascua@gmail.com"
  },
  {
    "clubname": "IHS Psychology Club",
    "clubadvisor": "Ms. Gallo",
    "clubleader": "Pujitha Velivela",
    "Club Secretary:": "Alexis Celine Kim",
    "clubmeeting": "Friday, TBD, WL 5",
    "clubinfo": "IHS Psychology Club is a club supported by NAMI(National Alliance on Mental Illness) that hosts events and activities, provide information, and inspire change that promotes the lessening of stigma due to mental health issues. We support those with mental health issues on campus through our events(disclaimer: we are not a mental health support group or otherwise), those who pursue psychology-related related path, and NAMI & its affiliates. Mental health is as important as physical health, and we should all work to believe that!",
    "contactinfo": "RachealForman@iusd.org &  pujitha.velivela29@gmail.com",
    "Secretary Email:": "celinekim0615@gmail.com"
  },
  {
    "clubname": "IHS Quiz Bowl Club",
    "clubadvisor": "Jeff Prugpichailers",
    "clubleader": "Michael Naguib",
    "Club Secretary:": "Alexis Tran",
    "clubmeeting": "Tuesdays, Lunch, M5",
    "clubinfo": "Quiz Bowl is a fun, team-based knowledge competition. Teams of four earn points by correctly answering questions from a variety of topics: music, pop culture, math, literature, science, sports, geography, history, and more. The purpose of this club is to offer IHS students an opportunity to flex their trivia muscles, bond with teammates, and compete in tournaments with other schools.",
    "contactinfo": "JeffPrugpichailers@iusd.org & Michael2.Naguib2@gmail.com",
    "Secretary Email:": "AlexisHTran@hotmail.com"
  },
  {
    "clubname": "IHS Robotics Club",
    "clubadvisor": "Archana Jain",
    "clubleader": "Majd Katabi ",
    "Club Secretary:": "Allen Weng",
    "clubmeeting": "TBD- room UA9",
    "clubinfo": "In the club we cooperatively brainstorm, create, and test a robot while learning how to do a variety of things such as time manage and work as a team. During the spring we will use the robot to compete in regional competitions in which people from different countries and states come to compete in. No prior experience is necessary to join the club as members will get the chance to learn to do what they like or even try new things.",
    "contactinfo": " archanajain@iusd.org & mkatabi9082@gmail.com",
    "Secretary Email:": "ttaw2014@yahoo.com"
  },
  {
    "clubname": "Improv Club",
    "clubadvisor": "Chelsea Skoien",
    "clubleader": "Dilynn Cathey",
    "Club Secretary:": "Sawyer Cathey",
    "clubmeeting": "Fridays, lunch, Drama room (we also have after school practices on Wednesday, from 4-5, in the amphitheater!)",
    "clubinfo": "In improv club we do fun spontaneous acting games! It's a good way to practice public speaking and make some friends along the way!",
    "contactinfo": "chelseaskion@iusd.org & dfjcathey@gmail.com",
    "Secretary Email:": "shjcathey@gmail.com"
  },
  {
    "clubname": "Irvine Business",
    "clubadvisor": "Mrs. Kleczko",
    "clubleader": "Prasanthi Mantena/Siya Madan",
    "Club Secretary:": "TBD",
    "clubmeeting": "TBD",
    "clubinfo": "Irvine Business is a club that focuses on entrepreneurship, and business ideas that enhance business transactions. We have guest speakers, and fun projects about building a business which gives our members insight into the business world. We have many opportunities for our members to explore their passion towards business, marketing, entrepreneurship, commerce and sales.",
    "contactinfo": "VictoriaKleczko@iusd.org & Prasanthi.mantena117@gmail.com & siyamadan10@gmail.com"
  },
  {
    "clubname": "Irvine Climbers",
    "clubadvisor": "Luna Bai",
    "clubleader": "Conner Cruz",
    "Club Secretary:": "Troy Santiago",
    "clubmeeting": "TBD, Lunch once a week, TBD",
    "clubinfo": "Irvine Climbers is an all-inclusive club for everyone regardless of previous climbing experience. We are a group of passionate rock climbers who wish to spread our knowledge to Irvine, and connect with others who share our passion or simply interested in the sport! We function through club fundraisers, with a portion of the proceeds going to climbing non-profit organizations. In the future, look forward to club visits to local rock climbing gyms, rock climbing movie presentations, and interactive climbing lessons!",
    "contactinfo": "LunaBai@iusd.org & connerkcruz@gmail.com",
    "Secretary Email:": "troy.jpeg@gmail.com"
  },
  {
    "clubname": "Irvine High SASA",
    "clubadvisor": "Toura",
    "clubleader": "Tej Thakur",
    "Club Secretary:": "Nikhil Dhodia",
    "clubmeeting": "Thursdays/Fridays, during lunch, S4",
    "clubinfo": "Irvine High SASA is a club that aims to create a south asian community for students, as well as create events such as Diwali party and culture show, for students to bond and celebrate their culture.",
    "contactinfo": "NeetuToura@iusd.org & tej.thakur@icloud.com",
    "Secretary Email:": "dhodianikhil@gmail.com"
  },
  {
    "clubname": "Irvine Linens N Love",
    "clubadvisor": "Sarah Chung",
    "clubleader": "Situ Chintakunta/Shelby Lee",
    "Club Secretary:": "Annie Schwarzbart",
    "clubmeeting": "no longer hold meetings in school",
    "clubinfo": "Irvine Linens N Love is a service based nonprofit chapter originally founded on the basis of collecting unwanted linens from hotels and donating them to various shelters. As we have expanded city wide, our mission also greatly focuses on impact based projects targeting areas of necessity such as homelessness, food scarcity, hygiene, healthcare, and more. LNL looks forward to hosting hands-on group volunteer events this school year to target and impact the areas of our city most in need.",
    "contactinfo": "SarahChung@iusd.org, 24chintakusitu@gmail.com & shelbyshelby.322@gmail.com",
    "Secretary Email:": "annieschwarzbart@gmail.com"
  },
  {
    "clubname": "Irvine Machine Learning Organization",
    "clubadvisor": "Faten Sakallah",
    "clubleader": "Raksheta Kulkarni/Megha Ayyaswamy",
    "Club Secretary:": "Shivani Joshi",
    "clubmeeting": "First Monday of every month @ lunch in M6",
    "clubinfo": "Our goal is to introduce high school students to machine learning and enrich their skills by providing educational resources and local competitions. Machine learning is a prevalent field and will continue to be in the future, and we want to encourage more individuals to delve into the field. Through IMLO, members will get a headstart for a successful career.",
    "contactinfo": "FatenSakallah@iusd.org, 15raksheta.k@gmail.com, megha.ayyaswamy@gmail.com",
    "Secretary Email:": "shivanijjoshi1108@gmail.com"
  },
  {
    "clubname": "Irvine Repair Consortium",
    "clubadvisor": "Mr. Elmasri",
    "clubleader": "Rishi Padmanabhan",
    "Club Secretary:": "Sid Joshi",
    "clubmeeting": "Wednesday, Lunch, S5",
    "clubinfo": "Irvine Repair Consortium is a nonprofit organization aiming to empower students to combat climate change through entrepreneurship and the art of fixing electronics.",
    "contactinfo": "josephelmasri@iusd.org & rishi.padman@gmail.com",
    "Secretary Email:": "showing@gmail.com"
  },
  {
    "clubname": "Irvine Sea",
    "clubadvisor": "Ms. Cortez",
    "clubleader": "Ananya Karthi/Khushi Rajesh",
    "Club Secretary:": "Tymen Koetsier",
    "clubmeeting": "TBD, Lunch, SLG",
    "clubinfo": "SEA is an organization that focuses on engaging less fortunate children with entertaining and academic activities. SEA stands for Science, Engineering, and Art. Our main goal for SEA is to get kids involved with fun activities that they might not be able to participate in on a daily basis.",
    "contactinfo": "MichelleCortez@iusd.org & ananyawp@gmail.com & khushirajesh08@gmail.com",
    "Secretary Email:": "tykoetsier@gmail.com"
  },
  {
    "clubname": "Irvine Urban Dance",
    "clubadvisor": "Mrs. Sloate",
    "clubleader": "Jina Asadidoust",
    "Club Secretary:": "Roma Burman",
    "clubmeeting": "Wednesday, lunch, dance room",
    "clubinfo": "IHSUD is a place where we teach small routines during lunch. We want to bring people together through music and dancing. It is a way for students to step out and have fun. The club is open to everyone and whoever that wants to learn routines. For students who want to be members, we do require them to audition. However, dancing hip hop is a great way for people to have fun, meet others students, and preform.",
    "contactinfo": "sherylsloate@iusd.org & asadidoust.jina@gmail.com",
    "Secretary Email:": "romaburman6@gmail.com"
  },
  {
    "clubname": "ITV",
    "clubadvisor": "Mrs. Phillips",
    "clubleader": "Lana Alsamawi",
    "Club Secretary:": "Kendall Miller",
    "clubmeeting": "Friday at lunch and UA06",
    "clubinfo": "We’re advanced video students and we’re helping to raise for broadcast",
    "contactinfo": "Rebeccahphillips@iusd.org & lanaalsamawi3@gmail.com",
    "Secretary Email:": "22kmmiller@gmail.com"
  },
  {
    "clubname": "Japanese culture club",
    "clubadvisor": "Mrs. Frazer",
    "clubleader": "Mungunzul Jambal",
    "Club Secretary:": "Mrs.Frazer",
    "clubmeeting": "Last Wednesday of every month at lunch in WL12",
    "clubinfo": "This club is for students who likes Japanese culture and people who wants to learn other countries’ culture. We will promote Japanese language.",
    "contactinfo": "ashleighfrazer@iusd.org  & jmungunzul42@gmail.com",
    "Secretary Email:": "ashleighfrazer@iusd.org"
  },
  {
    "clubname": "K-Crew",
    "clubadvisor": "Mrs. Sloate",
    "clubleader": "Kayla Kwak",
    "Club Secretary:": "Kimberly Lau",
    "clubmeeting": "Every Thursdays @lunch in dance room",
    "clubinfo": "K-Crew covers one k-pop dance in each meeting. All the dances we learn are recommended by the members, and the leaders teach them. In the meantime, we will practice for the performance for the rally if there is a chance.",
    "contactinfo": "sherylsloate@iusd.org & kkayla1052@gmail.com",
    "Secretary Email:": "kimberlywlau@gmail.com"
  },
  {
    "clubname": "Key Club",
    "clubadvisor": "Mr. Elmasri",
    "clubleader": "Heather Chen",
    "Club Secretary:": "Nikitha Mateti",
    "clubmeeting": "Thursday (1-2 times per month, more often once), Lunch, HLG",
    "clubinfo": "Key Club is an international, student-led organization that provides its members with opportunities, to provide service, build character, and develop leadership. Our core values include leadership, character building, caring, and inclusiveness.",
    "contactinfo": "josephelmasri@iusd.org & ninghc836@gmail.com",
    "Secretary Email:": "nikithamateti@gmail.com"
  },
  {
    "clubname": "Koncerts 4 Kause",
    "clubadvisor": "Mr. Venlet",
    "clubleader": "So Takagi",
    "Club Secretary:": "TBD",
    "clubmeeting": "Once or Twice every month, during lunch, Instrumental music room",
    "clubinfo": "In K4K, we, as a group of wonderful and talented musicians, will go around the community such as senior centers and school events in order to spread our love for music. Our goal is to create an interest in music for everyone that we perform to. People would join in order to show their musical skills as well as create a community that loves and respects music.",
    "contactinfo": "DerekVenlet@iusd.org & sotakagi717@gmail.com",
    "Secretary Email:": "TBD"
  },
  {
    "clubname": "Korean National Honor Society",
    "clubadvisor": "Mrs. Yu",
    "clubleader": "Felicia Tao",
    "Club Secretary:": "Mikaila Yim",
    "clubmeeting": "Second and fourth Thursday of the month, @lunch, WL7",
    "clubinfo": "KNHS aims to promote interest in the study of Korean, to reward scholastic achievement, and promote an understanding and appreciation of the Korean culture, language, and civilization. Members are available during Flex time to aid students in Korean and participate in many club activities.",
    "contactinfo": "suyoungyu@iusd.org & felicia.tao777@gmail.com",
    "Secretary Email:": "mikailayim@gmail.com"
  },
  {
    "clubname": "Korean Tutor Club",
    "clubadvisor": "Mrs. Kleczko",
    "clubleader": "Eunjie Hong",
    "Club Secretary:": "Linda Chang",
    "clubmeeting": "every other wednesday during lunch at WL10",
    "clubinfo": "As a president, I would be assigning students to club members so that students can start learning through zoom meeting. I would help club members with study materials. People should join the club if they are interested in education and Korean so that they can develop their own social and educational skills.",
    "contactinfo": "VictoriaKleczko@iusd.org &  eunjie1128@gmail.com",
    "Secretary Email:": "lmchang1031@gmail.com"
  },
  {
    "clubname": "Mandarin Student Association",
    "clubadvisor": "Ms. Frazer",
    "clubleader": "Cyndi Ye",
    "Club Secretary:": "Phoebe Lin",
    "clubmeeting": "first week of the month during lunch in WL12",
    "clubinfo": "Mandarin Student Association is a club that gathers all students who speak Chinese and/or are interested in learning Chinese and the culture at Irvine High. MSA will also provide with opportunities to participate in voluntary activities involving Chinese culture and important events in Chinese history.",
    "contactinfo": "AshleighFrazer@iusd.org & cyndi.yeh123004@gmail.com",
    "Secretary Email:": "phoebe.036.lin@gmail.com"
  },
  {
    "clubname": "Math Olympiad",
    "clubadvisor": "Ms. Bai",
    "clubleader": "Brian Song",
    "Club Secretary:": "Ryan Lin",
    "clubmeeting": "Every other Monday at lunch in S2",
    "clubinfo": "Math Olympiad is a club to provide an educational and competitive environment for students interested in developing their knowledge of mathematics and being challenged in this field. We plan to attend some fun competitions, work on challenging problems, and provide help to whoever needs it.",
    "contactinfo": "lunabai@iusd.org & brians3476@gmail.com",
    "Secretary Email:": "ryanis2smart@gmail.com"
  },
  {
    "clubname": "Math Together",
    "clubadvisor": "Mrs. Fair",
    "clubleader": "Elizabeth Kim",
    "Club Secretary:": "Sophia(Yunfei) Ke",
    "clubmeeting": "Every other Friday, 3:45-4:30 p.m., M8",
    "clubinfo": "In this club, members will work on math homework together, study together for quiz or test, and help each other. Basically, club members will help each other and I would recommend people who want to study together and interact with people regarding to math to join this club.",
    "contactinfo": "stephaniefair@iusd.org & elizabethkim1215@gmail.com",
    "Secretary Email:": "sophiakk0528@gmail.com"
  },
  {
    "clubname": "Miracles for Kids",
    "clubadvisor": "Raymond Wong",
    "clubleader": "Kamryn Thongsrinoon",
    "Club Secretary:": "Kylie Thongsrinoon",
    "clubmeeting": "Once a month, Lunch, M9",
    "clubinfo": "Miracles for Kids is an organization that helps with critically ill children and it is a great opportunity to volunteer in person, as well as from school. We can help provide families with food, clothing, shelter and more by donating and helping with their events and more, so the parents can focus on the care their child needs.",
    "contactinfo": "raymondwong@iusd.org & kamiekamt@gmail.com",
    "Secretary Email:": "kykythongsrinoon@gmail.com"
  },
  {
    "clubname": "Mock Trial",
    "clubadvisor": "Mr. Cassity",
    "clubleader": "Isabella Wang",
    "Club Secretary:": "Jeslyn Chuang",
    "clubmeeting": "Tues/Thurs, 4:30-6:00, S7",
    "clubinfo": "Mock trial simulates a real-life courtroom where attorneys present a case by calling up witnesses and asking them questions in cross and direct. It is a unique experience where participants learn about courtroom procedures and get to partake in the activity that utilizes both speech and debate skills.",
    "contactinfo": "jaycassity@iusd.org & 24isabellawang@gmail.com",
    "Secretary Email:": "jeslynchuang@gmail.com"
  },
  {
    "clubname": "Model United Nations",
    "clubadvisor": "Dr. Hurst",
    "clubleader": "Mannat"
  },
  {
    "clubname": "National Art Honor Society",
    "clubadvisor": "Mr. Perales",
    "clubleader": "Olivia Madden",
    "Club Secretary:": "Mara Brucher",
    "clubmeeting": "Every other Tuesday in UA11 at lunch",
    "clubinfo": "Be a part of the National Arts Honor Society to connect your passion for the arts to service and leadership opportunities, scholarships, nationally recognized awards and exhibits, and participate in arts advocacy events throughout the year!",
    "contactinfo": "erikaperales@iusd.org & ms.olivia.madden@gmail.com",
    "Secretary Email:": "marabrucher@gmail.com"
  },
  {
    "clubname": "National History Day",
    "clubadvisor": "Harrington",
    "clubleader": "Jiwon Jeong",
    "Club Secretary:": "Zhongwen Zhang",
    "clubmeeting": "3rd week of Friday every month, SS 202",
    "clubinfo": "National History Day is an annual competition where you pick a historical topic pertaining to the theme (Frontiers in History: People, Places, Ideas) and spend a few months researching and creating a project around it! You can submit a paper, exhibit, website, documentary, or performance, either individually or with a group, based on a topic of your choice. Competitors who excel can advance into the state competition in Sacramento or the national competition in Washington D.C.!",
    "contactinfo": "JenniferHarrington@iusd.org & jiwonjeong414@gmail.com",
    "Secretary Email:": "24zhangzhongwen@gmail.com"
  },
  {
    "clubname": "National Honor Society",
    "clubadvisor": "Matthew Cali",
    "clubleader": "Megan Lai",
    "Club Secretary:": "Arjun Dabir",
    "clubmeeting": "Fridays, HLG",
    "clubinfo": "National Honor Society is an academic-honor club for students with a 3.8 GPA (weighted) or higher. Members participate in community service projects throughout the school and Orange County. Members are expected to be dedicated and hard-working members of the student body. Members must compelte a minimum of 25 hours each year.",
    "contactinfo": "MatthewCali@iusd.org, meganlai123@gmail.com irvinehighnhs@gmail.com",
    "Secretary Email:": "arjunadabir@gmail.com"
  },
  {
    "clubname": "Operation Be Kind",
    "clubadvisor": "Ms. Hughes",
    "clubleader": "Ava Dinh",
    "Club Secretary:": "Catalina MacIntyre",
    "clubmeeting": "First week of every month on tuesday. Room S10, 12:15",
    "clubinfo": "Operation Be Kinds mission is to help the homeless and those in need. People should join because we teach and inspire the youth to be kind and compassionate. (“Spreading kindness one mission at a time”)",
    "contactinfo": "kerryhughes@iusd.org & dinhava123@gmail.com",
    "Secretary Email:": "llinamac16@gmail.com"
  },
  {
    "clubname": "Orphan Assistance Fund Club (OAFC)",
    "clubadvisor": "Kerry Hughes",
    "clubleader": "Quincy Nguyen",
    "Club Secretary:": "Rishabh Dedhia",
    "clubmeeting": "Every other Friday, 12:20 pm, Room S10",
    "clubinfo": "The Orphan Assistance Fund Club is a student-run 501c3 nonprofit organization dedicated to helping orphans all over the world, as well as promoting student leadership. The Orphan Assistance Fund is projected to have 20 different clubs across Orange County, Riverside, and San Diego. We provide service hours and fundraising opportunities which help local foster care foundations and orphanages overseas.",
    "contactinfo": "kerryhughes@iusd.org & quincynguyenv@gmail.com",
    "Secretary Email:": "rishabh.dedhia05@gmail.com"
  },
  {
    "clubname": "Peer1on1",
    "clubadvisor": "Karen Briseno",
    "clubleader": "Vedhika Mohankumar",
    "Club Secretary:": "Alexa Jones",
    "clubmeeting": "Thursdays, Lunch, WL5",
    "clubinfo": "Peer1on1 aims to provide a safe environment to socialize for neurodivergent individuals. We also spread neurodiversity awareness through our community.",
    "contactinfo": "karenbriseno@iusd.org & myvedhika.mohankumar@gmail.com",
    "Secretary Email:": "tinker72306@gmail.com"
  },
  {
    "clubname": "Photography Club",
    "clubadvisor": "Erika Perales",
    "clubleader": "Idhika Padh",
    "Club Secretary:": "Prachi SInha",
    "clubmeeting": "Tuesdays every other week, during lunch, UA11",
    "clubinfo": "This club invites all students who are interested in art, especially photography. We will be applying to national photography competitions throughout the year.",
    "contactinfo": "erikaperales@iusd.org & idhikapadhi@gmail.com",
    "Secretary Email:": "25prachisinha@gmail.com"
  },
  {
    "clubname": "Physics Club",
    "clubadvisor": "Mr. Elmasri",
    "clubleader": "Brian Song",
    "Club Secretary:": "Andrew Ding",
    "clubmeeting": "Fridays during all of lunch, Room S5",
    "clubinfo": "We are a group in the student body who is dedicated to learning more in the various fields of physics, ranging from orbital mechanics to electrostatics, and finding neat applications of the subject in real life. We also strive to inspire other students in learning more about this fascinating topic and to be a hub where everyone can come and learn. Join to discover exciting concepts, work together on challenging problems, or receive help from fellow peers!",
    "contactinfo": "josephelmasri@iusd.org & brians3476@gmail.com",
    "Secretary Email:": "dingandrew23@gmail.com"
  },
  {
    "clubname": "Principled Approach",
    "clubadvisor": "Mr. Cali",
    "clubleader": "Zhongwen Zhang",
    "Club Secretary:": "Leo Feng",
    "clubmeeting": "Wednesdays, 12:15PM, SS204",
    "clubinfo": "Principled Approach encourages students to think about the world, recognizing the complexities and nuances of every issue. Each meeting, we study and discuss ethical dilemmas and potential ways to address them. Our meetings focus on understanding issues, rather than winning arguments, sometimes recognizing that there's no perfect solution.",
    "contactinfo": "MatthewCali@iusd.org & 24zhangzhongwen@gmail.com",
    "Secretary Email:": "fengleoy@gmail.com"
  },
  {
    "clubname": "Project Club",
    "clubadvisor": "Michelle Cortez",
    "clubleader": "Yihan(Leo) Feng",
    "Club Secretary:": "Nathan Phan",
    "clubmeeting": "Every Monday, 12:15-12:45, S1",
    "clubinfo": "We create different types of projects every week which club members will need to create quickly. This helps improve teamwork, creativity, and communication.",
    "contactinfo": "MichelleCortez@iusd.org & fengleoy@gmail.com",
    "Secretary Email:": "nap3mail@gmail.com"
  },
  {
    "clubname": "Red Cross Club",
    "clubadvisor": "Mrs. Kamai",
    "clubleader": "Meghaa Saravanan",
    "Club Secretary:": "TBD",
    "clubmeeting": "First Thursday of every month, Lunch, HLG",
    "clubinfo": "Red Cross Club is a group that provides you and your peers with opportunities to make a difference by addressing your community's greatest needs and developing leadership skills. Red Cross Clubs empower you with knowledge and life-saving skills to help prepare your school and community to respond to emergencies.",
    "contactinfo": "KristinKamai@iusd.org & 6meghaa@gmail.com",
    "Secretary Email:": "6meghaa@gmail.com"
  },
  {
    "clubname": "Science Olympiad",
    "clubadvisor": "Mr. Elmasri",
    "clubleader": "Brian Song",
    "Club Secretary:": "Aashay Mody",
    "clubmeeting": "Saturday afternoons, 1-4 PM, S5",
    "clubinfo": "At Science Olympiad, we prepare for and compete in various science-oriented competitions. Our purpose is to gain a better understanding of science, and we study together as a team. Join to be part of a tight-knit community of scholars, and earn recognition and medals along the way!",
    "contactinfo": "josephelmasri@iusd.org & brians3476@gmail.com",
    "Secretary Email:": "aashaymody17@gmail.com"
  },
  {
    "clubname": "Self developed",
    "clubadvisor": "Mr. Larnard",
    "clubleader": "Candy Velazquez",
    "Club Secretary:": "Farida",
    "clubmeeting": "The first and second Thursday of every month at  12:04-12:40 pm, HLG",
    "clubinfo": "Self develop is a high school club that provides useful and life changing tips & habits. In this club students will be engaging in practices where they will learn how to live a life of effectiveness and success. Our club strives to show habits that will not only help students during high school but also when they step out onto the real world.",
    "contactinfo": "clubadvisor EMAIL & candyv3638@gmail.com",
    "Secretary Email:": "yasserfarida209@gmail.com"
  },
  {
    "clubname": "Sing for Joy",
    "clubadvisor": "Ms. Smiley",
    "clubleader": "Sriya Vollala",
    "Club Secretary:": "Naksha Srinivasan",
    "clubmeeting": "Tuesdays, 12:10 - 12:25, SS101",
    "clubinfo": "SingForJoy is a club that aims to spread joy and positivity through music by caroling at nursing homes and hospitals in order to spread. People of all musical levels are welcome and are encouraged to join.",
    "contactinfo": "KatherineSmiley@iusd.org & sriya.vollala@gmail.com",
    "Secretary Email:": "nakshastar.srinivasan@gmail.com"
  },
  {
    "clubname": "Slapstick Wrangling",
    "clubadvisor": "Mr. Szczudlak",
    "clubleader": "Ameen Khorshidi",
    "Club Secretary:": "Vishal Viswaprassa",
    "clubmeeting": "Tuesday during lunch, Room 102",
    "clubinfo": "Slapstick Wrangling is a club where members will debate around satirical topics, such as \"What's the Best Type of Cheese?\" This club was established to help relieve stress through mild debates which are debates that require no research or prior knowledge. People should join to have fun by arguing silly-mannered and satirical debates to prove that they will always be right.",
    "contactinfo": "keithszczudlak@iusd.org & ameen.khorshidi@outlook.com",
    "Secretary Email:": "vishalviswa88@gmail.com"
  },
  {
    "clubname": "Smile Train",
    "clubadvisor": "Mrs. Skoien",
    "clubleader": "Naksha Srinivasan",
    "Club Secretary:": "Sreenidhi Srinivasan",
    "clubmeeting": "Last Friday of every Month, Lunch, Drama room",
    "clubinfo": "We create, spread, and perform music to raise funds for children with cleft-chins. We can create multiple groups of music performers who are talented and help them gain not only a generous amount of hours, but also experience live shows to help a certain cause.",
    "contactinfo": "ChelseaSkoien@iusd.org & nakshastar.srinivasan@gmail.com",
    "Secretary Email:": "sreenidhi.s@gmail.com"
  },
  {
    "clubname": "Society of Women Engineers",
    "clubadvisor": "Jain",
    "clubleader": "Harleen Ahluwalia",
    "Club Secretary:": "TBD",
    "clubmeeting": "Once every other week, Lunch, UA 9",
    "clubinfo": "Society Of Women Engineers is a club open to all created to provide an educational and inquisitive environment. Especially for the females at our school who are interested in engineering.",
    "contactinfo": "ArchanaJain@iusd.org & harleenahluwalia01@gmail.com",
    "Secretary Email:": "TBD"
  },
  {
    "clubname": "Spanish Honor Society",
    "clubadvisor": "Ms. Thompson",
    "clubleader": "Sofia Nieves",
    "Club Secretary:": "Selena Zheng",
    "clubmeeting": "Wednesdays, 12:05 - 12:40, Room WL6",
    "clubinfo": "The Sociedad Honoraria Hispánica is an honor society for high school students enrolled in Spanish and/or Portuguese, sponsored by the American Association of Teachers of Spanish and Portuguese. The purpose of the Society is to recognize high achievement in Spanish and Portuguese by students of secondary schools and to promote continuity of interest in Hispanic and Luso-Brazilian studies. This club is intended for those who hope to support our community and those seeking more about Latinoamerician culture.",
    "contactinfo": "leticiathompson@iusd.org & 24nievessofia@gmail.com",
    "Secretary Email:": "selena.owl129@gmail.com"
  },
  {
    "clubname": "Speech and Decate",
    "clubadvisor": "Ms. Cortez",
    "clubleader": "Rohan Frijo",
    "Club Secretary:": "Parth Gupta & Taewon Kim",
    "clubmeeting": "Tuesday, 12:05 Room: SLG",
    "clubinfo": "Speech and Debate is a very good club to join because it will help all aspects of your life. Speech and debate improves critical thinking, interpersonal skills, and public speaking, which are all very important.",
    "contactinfo": "michellecortez@iusd.org & rohanfrijo@gmail.com",
    "Secretary Email:": "parth2007gupta@gmail.com &  taewonkim06@gmail.com"
  },
  {
    "clubname": "Sticky Stickers Club",
    "clubadvisor": "Miriam Khurgel",
    "clubleader": "Joshua Tio",
    "Club Secretary:": "Kendall Do",
    "clubmeeting": "Thursday (weekly), lunch, UA3",
    "clubinfo": "The Sticky Stickers Club is a club where artists are able to create any original art piece (only SFW art) they create into a usable vinyl sticker. We also have opportunity for members to form sticker groups to create themed sticker packs to promote a cause that they are passionate about.",
    "contactinfo": "miriamkhurgel@iusd.org& joshuatio98@gmail.com",
    "Secretary Email:": "mmkmdo2023@gmail.com"
  },
  {
    "clubname": "Students for Racial Equality",
    "clubadvisor": "Ms. Brophy",
    "clubleader": "Alexis Tran",
    "Club Secretary:": "TBD",
    "clubmeeting": "Every other Wednesday, lunch, Room SS #201",
    "clubinfo": "Students For Racial Equality’s purpose is to educate students on issues pertaining to racial injustices. We hope to create a safe place for students who are BIPOC, and encourage people to take action on issues.",
    "contactinfo": "meganbrophy@iusd.org & alexishtran@hotmail.com",
    "Secretary Email:": "TBD"
  },
  {
    "clubname": "The Club Of Opportunity",
    "clubadvisor": "Bre Eagleson",
    "clubleader": "Aisha Bilgrammi",
    "Club Secretary:": "TBD",
    "clubmeeting": "Fridays during lunch",
    "clubinfo": "This club will provide students with numerous opportunities to learn valuable life skills and real world experiences. Workshops will teach members professional, academic, and other life skills to help them be more successful. Students also learn how to carry out their social responsibilities in their professional and personal lives, as well as how to honor themselves and others beyond high school.",
    "contactinfo": "breeagleson@iusd.org & aishabilgrammi@gmail.com",
    "Secretary Email:": "TBD"
  },
  {
    "clubname": "Tutoring ",
    "clubadvisor": "Kurdziel",
    "clubleader": "Michelle Liao",
    "Club Secretary:": "Ellie Chang",
    "clubmeeting": "Once every 3 weeks, Monday and Friday, 12:05-12:40, M10",
    "clubinfo": "This club is to help (especially those in middle school) people in subjects that they struggle on in school. This can range to all core subjects that are taught. We will create Youtube videos, Zoom calls, and occasionally some in person classes. It will be a great way to interact with others while also improving one's own skills through teaching.",
    "contactinfo": "KimKurdziel@iusd.org & Michelleliao2007@gmail.com",
    "Secretary Email:": "25changellie@iusd.org"
  },
  {
    "clubname": "Vietnamese Student Association (VSA)",
    "clubadvisor": "Sophia Chen",
    "clubleader": "David Nguyen",
    "Club Secretary:": "Francine Nguyen",
    "clubmeeting": "First Wednesday of every month, Lunchtime, H12",
    "clubinfo": "Our club is to represent Vietnamese culture at Irvine High. We want to showcase our cuisine, traditional dances, and language to the school. We are inclusive and welcome anyone who is interested in learning about Vietnamese culture!",
    "contactinfo": "sophiachen@iusd.org & daviiidnguyenn@gmail.com",
    "Secretary Email:": "francine2n@icloud.com"
  },
  {
    "clubname": "Walk of Life",
    "clubadvisor": "Mr. Joseph Elmasri",
    "clubleader": "Charline Chen",
    "Club Secretary:": "Mannat Bawa",
    "clubmeeting": "Saturday, 10-11 am, Virtual on Zoom",
    "clubinfo": "Walk of Life is a student club that introduces students to the modern workforce and helps them learn about different career lives through guest speaker events. Join Walk of Life today if you have a career you're interested in knowing more about!",
    "contactinfo": "JosephElmasri@iusd.org & charline.chen08@gmail.com",
    "Secretary Email:": "mannatkbawa@gmail.com"
  },
  {
    "clubname": "We Move Forward (WMF)",
    "clubadvisor": "Mindy",
    "clubleader": "Sophie",
    "Club Secretary:": "Charlene Wang",
    "clubmeeting": "TBD",
    "clubinfo": "The main purpose of this club is to end hunger for students in UC Davis because according to the research, half of the students in UC Davis are having hunger problem, which we hope we can create this club and trying to solve this problem. Students should join this club because it can help them gain useful and meaningful experiences.",
    "contactinfo": "126mindy@gmail.com &  sophieni2005@gmail.com",
    "Secretary Email:": "charlenewang411@gmail.com"
  },
  {
    "clubname": "Weightlifting Club",
    "clubadvisor": "Dr. Cohen",
    "clubleader": "Gene Choi",
    "Club Secretary:": "Ben Nguyen",
    "clubmeeting": "every 2 weeks, Monday during lunch in room H17",
    "clubinfo": "We encourage people to weight-lift not only to get stronger but also to have a healthy lifestyle. We help people that want to maintain their health and people that want to get stronger and healthier. You should join this club because one of our values we focus on is not only getting stronger, but also having a balanced and healthy life based off the gains you get from weightlifting.",
    "contactinfo": "laurencohen@iusd.org & gjchoi617@gmail.com",
    "Secretary Email:": "benjaminmmvii@gmail.com"
  },
  {
    "clubname": "YAT",
    "clubadvisor": "Harrington",
    "clubleader": "Angie Baik",
    "Club Secretary:": "Alyssa & Ellie",
    "clubmeeting": "Biweekly Tuesday in HLG during lunch",
    "clubinfo": "YAT has community service projects and social events that range from a variety of interests: volunteering outdoors, helping the special needs community, speaker series, and trivia night. An easy and fun way to get hours of community service and connect with other people from Irvine & other IUSD schools as well. ",
    "contactinfo": "JenniferHarrington@iusd.org & 23angieb@gmail.com",
    "Secretary Email:": " ellie.irianto@gmail.com & alysssssa1ee@gmail.com "
  },
  {
    "clubname": "Young Democratic Socialists of America ",
    "clubadvisor": "Ms. Oh",
    "clubleader": "June Jang/Emily Dissanayake",
    "Club Secretary:": "Sofía Aurora Cervantes/ Charlene Chang",
    "clubmeeting": "Every wednesday during lunch in Room SS104",
    "clubinfo": "Do you believe in transformative reforms and building a democratic, pro working class movement in America? Do you believe in centering struggles against racism, sexism, xenophobia, homophobia, and all other forms of oppression? We are the Irvine High student section of the Democratic Socialists of America and we support the creation of just campuses and communities.",
    "contactinfo": "RebeccaOh@iusd.org & 29june.j@gmail.com & emilydissanayake@gmail.com",
    "Secretary Email:": "23cervantesofia@gmail & email2charlene@gmail.com"
  }
]
